cases/Case01-Turbulent/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.1;

vertices        
(
	(0.0        0.234776332         0.010250556)        //0
  	(0.0        0.234776332        -0.010250556)        //1
	(0.0        0.342174016         0.01493964)         //2
	(0.0        0.342174016        -0.01493964)         //3
    (0.0        0.4495717           0.019628724)        //4
    (0.0        0.4495717          -0.019628724)        //5

 	(0.75        0.234776332         0.010250556)        //6
  	(0.75        0.234776332        -0.010250556)        //7
	(0.75        0.342174016         0.01493964)         //8
	(0.75        0.342174016        -0.01493964)         //9
    (0.75        0.4495717           0.019628724)        //10
    (0.75        0.4495717          -0.019628724)        //11

 	(1.5        0.234776332         0.010250556)        //12
  	(1.5        0.234776332        -0.010250556)        //13
	(1.5        0.342174016         0.01493964)         //14
	(1.5        0.342174016        -0.01493964)         //15
    (1.5        0.4495717           0.019628724)        //16
    (1.5        0.4495717          -0.019628724)        //17

	(-0.5        0.234776332         0.010250556)        //18
  	(-0.5        0.234776332        -0.010250556)        //19
	(-0.5        0.342174016         0.01493964)         //20
	(-0.5        0.342174016        -0.01493964)         //21
    (-0.5        0.4495717           0.019628724)        //22
    (-0.5        0.4495717          -0.019628724)        //23
);

edges
(
);

blocks
(
	// Central
	hex (0 6 7 1 2 8 9 3)       (60 1 6) simpleGrading (15  1  7)
	hex (2 8 9 3 4 10 11 5)     (60 1 5) simpleGrading (15  1  0.6)

	// Outlet
	hex (6 12 13 7 8 14 15 9)   (20 1 6) simpleGrading (1    1  7)
	hex (8 14 15 9 10 16 17 11) (20 1 5) simpleGrading (1    1  0.6)

	// Inlet
	hex (18 0 1 19 20 2 3 21)   (25 1 6) simpleGrading (0.03 1  7)    	
	hex (20 2 3 21 22 4 5 23)   (25 1 5) simpleGrading (0.03 1  0.6)
);

patches
(
   wall catalyticWall
   (
	(0 1 7 6)
    (6 7 13 12)
   )

	wall fixedWall
	(
	(4 10 11 5)
    (10 16 17 11)
    (18 19 1 0)
    (22 4 5 23)
 	)
 	
	wedge front 
	(
    (0 6 8 2)
    (2 8 10 4)
    (6 12 14 8)
    (8 14 16 10)
    (18 0 2 20)
    (20 2 4 22)
	)

	wedge back
	(
    (1 3 9 7)
    (3 5 11 9)
    (7 9 15 13)
    (9 11 17 15)
    (19 21 3 1)
    (21 23 5 3)
	)

	patch inlet
	(
	(18 20 21 19)
    (20 22 23 21)
	)
	
	patch outlet
	(
	(13 15 14 12)
    (15 17 16 14)
	)
);

mergePatchPairs 
(
);

// ************************************************************************* //
